{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv1",
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "data",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 3
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv2_1\/dw",
      "K" : 32,
      "blob_biases" : 5,
      "name" : "conv2_1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "conv1",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2_1\/sep",
      "K" : 32,
      "blob_biases" : 9,
      "name" : "conv2_1\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv2_1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv2_2\/dw",
      "K" : 64,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "conv2_2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "conv2_1\/sep",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2_2\/sep",
      "K" : 64,
      "blob_biases" : 17,
      "name" : "conv2_2\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv2_2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv3_1\/dw",
      "K" : 128,
      "blob_biases" : 21,
      "name" : "conv3_1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv2_2\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv3_1\/sep",
      "K" : 128,
      "blob_biases" : 25,
      "name" : "conv3_1\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv3_1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv3_2\/dw",
      "K" : 128,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "conv3_2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "conv3_1\/sep",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv3_2\/sep",
      "K" : 128,
      "blob_biases" : 33,
      "name" : "conv3_2\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv3_2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv4_1\/dw",
      "K" : 256,
      "blob_biases" : 37,
      "name" : "conv4_1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv3_2\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv4_1\/sep",
      "K" : 256,
      "blob_biases" : 41,
      "name" : "conv4_1\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv4_1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv4_2\/dw",
      "K" : 256,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "conv4_2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "conv4_1\/sep",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv4_2\/sep",
      "K" : 256,
      "blob_biases" : 49,
      "name" : "conv4_2\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv4_2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_1\/dw",
      "K" : 512,
      "blob_biases" : 53,
      "name" : "conv5_1\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv4_2\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_1\/sep",
      "K" : 512,
      "blob_biases" : 57,
      "name" : "conv5_1\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_1\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_2\/dw",
      "K" : 512,
      "blob_biases" : 61,
      "name" : "conv5_2\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_1\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_2\/sep",
      "K" : 512,
      "blob_biases" : 65,
      "name" : "conv5_2\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_2\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_3\/dw",
      "K" : 512,
      "blob_biases" : 69,
      "name" : "conv5_3\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_2\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_3\/sep",
      "K" : 512,
      "blob_biases" : 73,
      "name" : "conv5_3\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_3\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_4\/dw",
      "K" : 512,
      "blob_biases" : 77,
      "name" : "conv5_4\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_3\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_4\/sep",
      "K" : 512,
      "blob_biases" : 81,
      "name" : "conv5_4\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_4\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_5\/dw",
      "K" : 512,
      "blob_biases" : 85,
      "name" : "conv5_5\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_4\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_5\/sep",
      "K" : 512,
      "blob_biases" : 89,
      "name" : "conv5_5\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_5\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv5_6\/dw",
      "K" : 512,
      "blob_biases" : 93,
      "stride_x" : 2,
      "name" : "conv5_6\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "conv5_5\/sep",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv5_6\/sep",
      "K" : 512,
      "blob_biases" : 97,
      "name" : "conv5_6\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "conv5_6\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "conv6\/dw",
      "K" : 1024,
      "blob_biases" : 101,
      "name" : "conv6\/dw",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1024,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "conv5_6\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv6\/sep",
      "K" : 1024,
      "blob_biases" : 105,
      "name" : "conv6\/sep",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "conv6\/dw",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "pad_r" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "pool6",
      "size_x" : 7,
      "is_global" : 1,
      "top_shape_style" : 2,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "pool6",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "conv6\/sep",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 7,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fc7",
      "K" : 1024,
      "blob_biases" : 109,
      "name" : "fc7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1000,
      "bottom" : "pool6",
      "weights" : {

      },
      "pad_mode" : 0,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "prob",
      "type" : "softmax",
      "name" : "prob",
      "bottom" : "fc7"
    }
  ]
}